share/tutorials/incompressible/porous-simple/straight_duct_implicit/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  front
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  back
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  walls
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  porosityWall
  {
    type            slip;
    value           uniform (0 0 0);
  }
  inlet
  {
    type            flowRateInletVelocity;
    volumetricFlowRate  constant 0.1;
//        value           uniform (0.1 0 0);
  }
  outlet
  {
    type            inletOutlet;
    value           uniform (0 0 0);
    inletValue      uniform (0 0 0);
  }
  porosity
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
