share/tutorials/incompressible/porous-simple/straight_duct_implicit/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  front
  {
    type            zeroGradient;
  }
  back
  {
    type            zeroGradient;
  }
  walls
  {
    type            zeroGradient;
  }
  porosityWall
  {
    type            zeroGradient;
  }
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            fixedValue;
    value           $internalField;
  }
  porosity
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
