share/tutorials/incompressible/porous-simple/straight_duct_implicit/constant/porosityProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      porosityProperties;
}

porosity1
{
  type            DarcyForchheimer;
  active          yes;
  cellZone        porosity;
  DarcyForchheimerCoeffs
  {
    d   (5e7 -1000 -1000);
    f   (0 0 0);
    coordinateSystem
    {
      type    cartesian;
      origin  (0 0 0);
      coordinateRotation
      {
        type    axesRotation;
        e1      (1 0 0);    //(0.70710678 0.70710678 0);
        e2      (0 0 1);
      }
    }
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
