share/tutorials/incompressible/porous-simple/straight_duct_implicit/system/backgroundMeshDecomposition/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-08;
    relTol          0.05;
    smoother        GaussSeidel;
    cacheAgglomeration on;
    nCellsInCoarsestLevel 20;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  "(U|k|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    nSweeps         2;
    tolerance       1e-07;
    relTol          0.1;
  }
}
SIMPLE
{
  nUCorrectors    2;
  nNonOrthogonalCorrectors 0;
}
relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    U               0.7;
    k               0.9;
    epsilon         0.9;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
