share/tutorials/incompressible/porous-simple/straight_duct_implicit/system/meshQualityDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      meshQualityDict;
}

// Include defaults parameters from master dictionary
#includeEtc "case_dicts/meshQualityDict"

// vim: set ft=foam et sw=2 ts=2 sts=2:
